ArduPilot/ardupilot/modules/ChibiOS/os/hal/ports/STM32/STM32G0xx/hal_lld.h
/*
 * Configuration-related checks.
 */
#if !defined(STM32G0xx_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32G0xx_MCUCONF not defined"
#endif

#if defined(STM32G070xx) && !defined(STM32G070_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32G070_MCUCONF not defined"

#elif defined(STM32G031xx) && !defined(STM32G031_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32G031_MCUCONF not defined"

#elif defined(STM32G041xx) && !defined(STM32G041_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32G041_MCUCONF not defined"

#elif defined(STM32G071xx) && !defined(STM32G071_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32G071_MCUCONF not defined"

#elif defined(STM32G081xx) && !defined(STM32G081_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32G081_MCUCONF not defined"

#elif defined(STM32G0B1xx) && !defined(STM32G0B1_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32G0B1_MCUCONF not defined"

#elif defined(STM32G0B0xx) && !defined(STM32G0B0_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32G0B0_MCUCONF not defined"

#elif defined(STM32G0C1xx) && !defined(STM32G0C1_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32G0C1_MCUCONF not defined"

#endif

/*
 * Board files sanity checks.
 */
#if !defined(STM32_LSECLK)
#error "STM32_LSECLK not defined in board.h"
#endif

#if !defined(STM32_LSEDRV)
#error "STM32_LSEDRV not defined in board.h"
#endif

#if !defined(STM32_HSECLK)
#error "STM32_HSECLK not defined in board.h"
#endif

/* Device limits.*/
#include "stm32_limits.h"

/* Clock handlers.*/
#include "stm32_lse.inc"
#include "stm32_lsi.inc"
#include "stm32_hsi16.inc"
#include "stm32_hsi48.inc"
#include "stm32_hse.inc"

/*
 * HSI16 related checks.
 */
#if STM32_HSI16_ENABLED
#else /* !STM32_HSI16_ENABLED */

  #if STM32_SW == STM32_SW_HSISYS
    #error "HSI16 not enabled, required by STM32_SW"
  #endif

  #if (STM32_SW == STM32_SW_PLLRCLK) && (STM32_PLLSRC == STM32_PLLSRC_HSI16)
    #error "HSI16 not enabled, required by STM32_SW and STM32_PLLSRC"
  #endif

  /* NOTE: Missing checks on the HSI16 pre-muxes, it is also required for newer
     L4 devices.*/

  #if (STM32_MCOSEL == STM32_MCOSEL_HSI16) ||                               \
      (STM32_I2S1SEL == STM32_I2S1SEL_HSI16) ||                             \
      (STM32_I2S2SEL == STM32_I2S2SEL_HSI16) ||                             \
      ((STM32_MCOSEL == STM32_MCOSEL_PLLRCLK) &&                            \
       (STM32_PLLSRC == STM32_PLLSRC_HSI16)) ||                             \
      ((STM32_RCC_HAS_MCOSEL_PLLP == TRUE) &&                               \
       (STM32_MCOSEL == STM32_MCOSEL_PLLPCLK) &&                            \
       (STM32_PLLSRC == STM32_PLLSRC_HSI16)) ||                             \
      ((STM32_RCC_HAS_MCOSEL_PLLQ == TRUE) &&                               \
       (STM32_MCOSEL == STM32_MCOSEL_PLLQCLK) &&                            \
       (STM32_PLLSRC == STM32_PLLSRC_HSI16))
    #error "HSI16 not enabled, required by STM32_MCOSEL/I2S1SEL/I2S2SEL"
  #endif

  #if STM32_RCC_HAS_MCO2 == TRUE
    #if (STM32_MCO2SEL == STM32_MCO2SEL_HSI16) ||                           \
        ((STM32_MCO2SEL == STM32_MCO2SEL_PLLRCLK) &&                        \
         (STM32_PLLSRC == STM32_PLLSRC_HSI16)) ||                           \
        ((STM32_RCC_HAS_MCOSEL_PLLP == TRUE) &&                             \
         (STM32_MCO2SEL == STM32_MCO2SEL_PLLPCLK) &&                        \
         (STM32_PLLSRC == STM32_PLLSRC_HSI16)) ||                           \
        ((STM32_RCC_HAS_MCOSEL_PLLQ == TRUE) &&                             \
         (STM32_MCO2SEL == STM32_MCO2SEL_PLLQCLK) &&                        \
         (STM32_PLLSRC == STM32_PLLSRC_HSI16))
      #error "HSI16 not enabled, required by STM32_MCO2SEL"
    #endif
  #endif

  #if (STM32_USART1SEL == STM32_USART1SEL_HSI16)
    #error "HSI16 not enabled, required by STM32_USART1SEL"
  #endif
  #if (STM32_USART2SEL == STM32_USART2SEL_HSI16)
    #error "HSI16 not enabled, required by STM32_USART2SEL"
  #endif
  #if (STM32_LPUART1SEL == STM32_LPUART1SEL_HSI16)
    #error "HSI16 not enabled, required by STM32_LPUART1SEL"
  #endif

  #if (STM32_CECSEL == STM32_CECSEL_HSI16DIV)
    #error "HSI16 not enabled, required by STM32_CECSEL"
  #endif

  #if (STM32_I2C1SEL == STM32_I2C1SEL_HSI16)
    #error "HSI16 not enabled, required by STM32_I2C1SEL"
  #endif

  #if (STM32_I2S1SEL == STM32_I2S1SEL_HSI16)
    #error "HSI16 not enabled, required by STM32_I2S1SEL"
  #endif

  #if (STM32_LPTIM1SEL == STM32_LPTIM1SEL_HSI16)
    #error "HSI16 not enabled, required by STM32_LPTIM1SEL"
  #endif
  #if (STM32_LPTIM2SEL == STM32_LPTIM2SEL_HSI16)
    #error "HSI16 not enabled, required by STM32_LPTIM2SEL"
  #endif

  #if (STM32_RNGSEL == STM32_RNGSEL_HSI16)
    #error "HSI16 not enabled, required by STM32_RNGSEL"
  #endif

  #if (STM32_ADCSEL == STM32_ADCSEL_HSI16)
    #error "HSI16 not enabled, required by STM32_ADCSEL"
  #endif

#endif /* !STM32_HSI16_ENABLED */

/*
 * HSI48 related checks.
 */
#if STM32_RCC_HAS_HSI48
#if STM32_HSI48_ENABLED
#else /* !STM32_HSI48_ENABLED */

  #if STM32_MCOSEL == STM32_MCOSEL_HSI48
    #error "HSI48 not enabled, required by STM32_MCOSEL"
  #endif

  #if STM32_RCC_HAS_MCO2 == TRUE
    #if STM32_MCO2SEL == STM32_MCO2SEL_HSI48
      #error "HSI48 not enabled, required by STM32_MCO2SEL"
    #endif
  #endif

  #if (STM32_USBSEL == STM32_USBSEL_HSI48) && (HAL_USE_USB == TRUE)
    #error "HSI48 not enabled, required by STM32_USBSEL"
  #endif

#endif /* !STM32_HSI48_ENABLED */
#elif STM32_MCOSEL == STM32_MCOSEL_HSI48
    #error "HSI48 not available for STM32_MCOSEL"
#elif (STM32_RCC_HAS_MCO2 == TRUE) && (STM32_MCO2SEL == STM32_MCO2SEL_HSI48)
    #error "HSI48 not available for STM32_MCO2SEL"
#elif (STM32_USBSEL == STM32_USBSEL_HSI48) && (HAL_USE_USB == TRUE)
    #error "HSI48 not available for STM32_USBSEL"
#endif /* STM32_RCC_HAS_HSI48 */

/*
 * HSE related checks.
 */
#if STM32_HSE_ENABLED
#else /* !STM32_HSE_ENABLED */

  #if STM32_SW == STM32_SW_HSE
    #error "HSE not enabled, required by STM32_SW"
  #endif

  #if (STM32_SW == STM32_SW_PLLRCLK) && (STM32_PLLSRC == STM32_PLLSRC_HSE)
    #error "HSE not enabled, required by STM32_SW and STM32_PLLSRC"
  #endif

  #if (STM32_MCOSEL == STM32_MCOSEL_HSE) ||                                 \
      ((STM32_MCOSEL == STM32_MCOSEL_PLLRCLK) &&                            \
       (STM32_PLLSRC == STM32_PLLSRC_HSE)) ||                               \
      ((STM32_RCC_HAS_MCOSEL_PLLP == TRUE) &&                               \
       (STM32_MCOSEL == STM32_MCOSEL_PLLPCLK) &&                            \
       (STM32_PLLSRC == STM32_PLLSRC_HSE)) ||                               \
      ((STM32_RCC_HAS_MCOSEL_PLLQ == TRUE) &&                               \
       (STM32_MCOSEL == STM32_MCOSEL_PLLQCLK) &&                            \
       (STM32_PLLSRC == STM32_PLLSRC_HSE))
    #error "HSE not enabled, required by STM32_MCOSEL"
  #endif

  #if STM32_RCC_HAS_MCO2 == TRUE
    #if (STM32_MCO2SEL == STM32_MCO2SEL_HSE) ||                             \
        ((STM32_MCO2SEL == STM32_MCO2SEL_PLLRCLK) &&                        \
         (STM32_PLLSRC == STM32_PLLSRC_HSE)) ||                             \
        ((STM32_RCC_HAS_MCOSEL_PLLP == TRUE) &&                             \
         (STM32_MCO2SEL == STM32_MCO2SEL_PLLPCLK) &&                        \
         (STM32_PLLSRC == STM32_PLLSRC_HSE)) ||                             \
        ((STM32_RCC_HAS_MCOSEL_PLLQ == TRUE) &&                             \
         (STM32_MCO2SEL == STM32_MCO2SEL_PLLQCLK) &&                        \
         (STM32_PLLSRC == STM32_PLLSRC_HSE))
      #error "HSE not enabled, required by STM32_MCO2SEL"
    #endif
  #endif

  #if STM32_FDCANSEL == STM32_FDCANSEL_HSE
    #error "HSE not enabled, required by STM32_FDCANSEL"
  #endif

