ArduPilot/ardupilot/modules/ChibiOS/os/hal/ports/STM32/STM32G0xx/hal_lld.h
  #if STM32_RTCSEL == STM32_RTCSEL_HSEDIV
    #error "HSE not enabled, required by STM32_RTCSEL"
  #endif

  #if STM32_USBSEL == STM32_USBSEL_HSE
    #error "HSE not enabled, required by STM32_USBSEL"
  #endif

#endif /* !STM32_HSE_ENABLED */

/*
 * LSI related checks.
 */
#if STM32_LSI_ENABLED
#else /* !STM32_LSI_ENABLED */

  #if HAL_USE_RTC && (STM32_RTCSEL == STM32_RTCSEL_LSI)
    #error "LSI not enabled, required by STM32_RTCSEL"
  #endif

  #if STM32_MCOSEL == STM32_MCOSEL_LSI
    #error "LSI not enabled, required by STM32_MCOSEL"
  #endif

  #if STM32_RCC_HAS_MCO2 == TRUE
    #if STM32_MCO2SEL == STM32_MCO2SEL_LSI
      #error "LSI not enabled, required by STM32_MCO2SEL"
    #endif
  #endif

  #if STM32_LSCOSEL == STM32_LSCOSEL_LSI
    #error "LSI not enabled, required by STM32_LSCOSEL"
  #endif

#endif /* !STM32_LSI_ENABLED */

/*
 * LSE related checks.
 */
#if STM32_LSE_ENABLED
#else /* !STM32_LSE_ENABLED */

  #if STM32_RTCSEL == STM32_RTCSEL_LSE
    #error "LSE not enabled, required by STM32_RTCSEL"
  #endif

  #if STM32_MCOSEL == STM32_MCOSEL_LSE
    #error "LSE not enabled, required by STM32_MCOSEL"
  #endif

  #if STM32_RCC_HAS_MCO2 == TRUE
    #if STM32_MCO2SEL == STM32_MCO2SEL_LSE
      #error "LSE not enabled, required by STM32_MCO2SEL"
    #endif
  #endif

  #if STM32_LSCOSEL == STM32_LSCOSEL_LSE
    #error "LSE not enabled, required by STM32_LSCOSEL"
  #endif

  #if (STM32_USART1SEL == STM32_USART1SEL_LSE)
    #error "LSE not enabled, required by STM32_USART1SEL"
  #endif

#endif /* !STM32_LSE_ENABLED */

/**
 * @brief   STM32_HSIDIV field.
 */
#if (STM32_HSIDIV_VALUE == 1) || defined(__DOXYGEN__)
  #define STM32_HSIDIV              STM32_HSIDIV_1

#elif STM32_HSIDIV_VALUE == 2
  #define STM32_HSIDIV              STM32_HSIDIV_2

#elif STM32_HSIDIV_VALUE == 4
  #define STM32_HSIDIV              STM32_HSIDIV_4

#elif STM32_HSIDIV_VALUE == 8
  #define STM32_HSIDIV              STM32_HSIDIV_8

#elif STM32_HSIDIV_VALUE == 16
  #define STM32_HSIDIV              STM32_HSIDIV_16

#elif STM32_HSIDIV_VALUE == 32
  #define STM32_HSIDIV              STM32_HSIDIV_32

#elif STM32_HSIDIV_VALUE == 64
  #define STM32_HSIDIV              STM32_HSIDIV_64

#elif STM32_HSIDIV_VALUE == 128
  #define STM32_HSIDIV              STM32_HSIDIV_128

#else
  #error "invalid STM32_HSIDIV_VALUE value specified"
#endif

/**
 * @brief   PLL input clock frequency.
 */
#if (STM32_PLLSRC == STM32_PLLSRC_HSE) || defined(__DOXYGEN__)
  #define STM32_PLLCLKIN            (STM32_HSECLK / STM32_PLLM_VALUE)

#elif STM32_PLLSRC == STM32_PLLSRC_HSI16
  #define STM32_PLLCLKIN            (STM32_HSI16CLK / STM32_PLLM_VALUE)

#elif STM32_PLLSRC == STM32_PLLSRC_NOCLOCK
  #define STM32_PLLCLKIN            0

#else
#error "invalid STM32_PLLSRC value specified"
#endif

/*
 * PLL enable check.
 */
#if STM32_RCC_HAS_MCO2 == TRUE
  #if (STM32_SW == STM32_SW_PLLRCLK) ||                                     \
      (STM32_MCOSEL == STM32_MCOSEL_PLLRCLK) ||                             \
      (STM32_MCO2SEL == STM32_MCO2SEL_PLLRCLK) ||                           \
      ((STM32_RCC_HAS_MCOSEL_PLLP == TRUE) &&                               \
       ((STM32_MCOSEL == STM32_MCOSEL_PLLPCLK) ||                           \
        (STM32_MCO2SEL == STM32_MCO2SEL_PLLPCLK))) ||                       \
      ((STM32_RCC_HAS_MCOSEL_PLLQ == TRUE) &&                               \
       ((STM32_MCOSEL == STM32_MCOSEL_PLLQCLK) ||                           \
        (STM32_MCO2SEL == STM32_MCO2SEL_PLLQCLK))) ||                       \
      (STM32_TIM1SEL == STM32_TIM1SEL_PLLQCLK) ||                           \
      (STM32_TIM15SEL == STM32_TIM15SEL_PLLQCLK) ||                         \
      (STM32_RNGSEL == STM32_RNGSEL_PLLQCLK) ||                             \
      (STM32_ADCSEL == STM32_ADCSEL_PLLPCLK) ||                             \
      (STM32_I2S1SEL == STM32_I2S1SEL_PLLPCLK) ||                           \
      (STM32_I2S2SEL == STM32_I2S2SEL_PLLPCLK) ||                           \
      (STM32_FDCANSEL == STM32_FDCANSEL_PLLQCLK) ||                         \
      (STM32_USBSEL == STM32_USBSEL_PLLQCLK) ||                             \
      defined(__DOXYGEN__)
    /**
     * @brief   PLL activation flag.
     */
    #define STM32_ACTIVATE_PLL      TRUE

  #else
    #define STM32_ACTIVATE_PLL      FALSE
  #endif

  /**
   * @brief   STM32_PLLREN field.
   */
  #if (STM32_SW == STM32_SW_PLLRCLK) ||                                     \
      (STM32_MCOSEL == STM32_MCOSEL_PLLRCLK) ||                             \
      (STM32_MCO2SEL == STM32_MCO2SEL_PLLRCLK) ||                           \
      defined(__DOXYGEN__)
    #define STM32_PLLREN            (1 << 28)
  #else
    #define STM32_PLLREN            (0 << 28)
  #endif

#else /* STM32_RCC_HAS_MCO2 != TRUE */
  #if (STM32_SW == STM32_SW_PLLRCLK) ||                                     \
      (STM32_MCOSEL == STM32_MCOSEL_PLLRCLK) ||                             \
      ((STM32_RCC_HAS_MCOSEL_PLLP == TRUE) &&                               \
       (STM32_MCOSEL == STM32_MCOSEL_PLLPCLK)) ||                           \
      ((STM32_RCC_HAS_MCOSEL_PLLQ == TRUE) &&                               \
       (STM32_MCOSEL == STM32_MCOSEL_PLLQCLK)) ||                           \
      (STM32_TIM1SEL == STM32_TIM1SEL_PLLQCLK) ||                           \
      (STM32_TIM15SEL == STM32_TIM15SEL_PLLQCLK) ||                         \
      (STM32_RNGSEL == STM32_RNGSEL_PLLQCLK) ||                             \
      (STM32_ADCSEL == STM32_ADCSEL_PLLPCLK) ||                             \
      (STM32_I2S1SEL == STM32_I2S1SEL_PLLPCLK) ||                           \
      (STM32_I2S2SEL == STM32_I2S2SEL_PLLPCLK) ||                           \
      (STM32_FDCANSEL == STM32_FDCANSEL_PLLQCLK) ||                         \
      (STM32_USBSEL == STM32_USBSEL_PLLQCLK) ||                             \
      defined(__DOXYGEN__)
    /**
     * @brief   PLL activation flag.
     */
    #define STM32_ACTIVATE_PLL      TRUE

  #else
    #define STM32_ACTIVATE_PLL      FALSE
  #endif

  /**
   * @brief   STM32_PLLREN field.
   */
  #if (STM32_SW == STM32_SW_PLLRCLK) ||                                     \
      (STM32_MCOSEL == STM32_MCOSEL_PLLRCLK) ||                             \
      defined(__DOXYGEN__)
    #define STM32_PLLREN            (1 << 28)
  #else
    #define STM32_PLLREN            (0 << 28)
  #endif

