ArduPilot/ardupilot/modules/ChibiOS/os/hal/ports/STM32/STM32G0xx/hal_lld.h
#endif /* STM32_RCC_HAS_MCO2 != TRUE */

/**
 * @brief   STM32_PLLQEN field.
 */
#if (STM32_TIM1SEL == STM32_TIM1SEL_PLLQCLK) ||                             \
    (STM32_TIM15SEL == STM32_TIM15SEL_PLLQCLK) ||                           \
    (STM32_RNGSEL == STM32_RNGSEL_PLLQCLK) ||                               \
    (STM32_FDCANSEL == STM32_FDCANSEL_PLLQCLK) ||                           \
    (STM32_USBSEL == STM32_USBSEL_PLLQCLK) ||                               \
    ((STM32_RCC_HAS_MCOSEL_PLLQ == TRUE) &&                                 \
     ((STM32_MCOSEL == STM32_MCOSEL_PLLQCLK) ||                             \
      (STM32_MCO2SEL == STM32_MCO2SEL_PLLQCLK))) ||                         \
    defined(__DOXYGEN__)
#define STM32_PLLQEN                (1 << 24)
#else
#define STM32_PLLQEN                (0 << 24)
#endif

/**
 * @brief   STM32_PLLPEN field.
 */
#if (STM32_ADCSEL == STM32_ADCSEL_PLLPCLK) ||                               \
    (STM32_I2S1SEL == STM32_I2S1SEL_PLLPCLK) ||                             \
    (STM32_I2S2SEL == STM32_I2S2SEL_PLLPCLK) ||                             \
    ((STM32_RCC_HAS_MCOSEL_PLLP == TRUE) &&                                 \
     ((STM32_MCOSEL == STM32_MCOSEL_PLLPCLK) ||                             \
      (STM32_MCO2SEL == STM32_MCO2SEL_PLLPCLK))) ||                         \
    defined(__DOXYGEN__)
#define STM32_PLLPEN                (1 << 16)
#else
#define STM32_PLLPEN                (0 << 16)
#endif

/* Inclusion of PLL-related checks and calculations.*/
#include <stm32_pll_v2.inc>

/**
 * @brief   HSISYS clock frequency.
 */
#define STM32_HSISYSCLK             (STM32_HSI16CLK / STM32_HSIDIV_VALUE)

/**
 * @brief   System clock source.
 */
#if (STM32_SW == STM32_SW_HSISYS)
  #define STM32_SYSCLK              STM32_HSISYSCLK

#elif (STM32_SW == STM32_SW_HSE)
  #define STM32_SYSCLK              STM32_HSECLK

#elif (STM32_SW == STM32_SW_PLLRCLK)
  #define STM32_SYSCLK              STM32_PLL_R_CLKOUT

#elif (STM32_SW == STM32_SW_LSI)
  #define STM32_SYSCLK              STM32_LSICLK

#elif (STM32_SW == STM32_SW_LSE)
  #define STM32_SYSCLK              STM32_LSECLK

#else
#error "invalid STM32_SW value specified"
#endif

/* Bus handlers.*/
#include "stm32_ahb.inc"
#include "stm32_apb.inc"

/*
 * Compatibility definitions.
 */
#define STM32_PCLK1                 STM32_PCLK
#define STM32_PCLK2                 STM32_PCLK

/**
 * @brief   MCO divider clock source.
 */
#if (STM32_RCC_HAS_MCOSEL_EXT == TRUE) || defined(__DOXYGEN__)
  #if (STM32_MCOSEL == STM32_MCOSEL_NOCLOCK) || defined(__DOXYGEN__)
    #define STM32_MCODIVCLK         0

  #elif STM32_MCOSEL == STM32_MCOSEL_SYSCLK
    #define STM32_MCODIVCLK         STM32_SYSCLK

  #elif STM32_MCOSEL == STM32_MCOSEL_HSI16
    #define STM32_MCODIVCLK         STM32_HSI16CLK

  #elif STM32_MCOSEL == STM32_MCOSEL_HSI48
    #define STM32_MCODIVCLK         STM32_HSI48CLK

  #elif STM32_MCOSEL == STM32_MCOSEL_HSE
    #define STM32_MCODIVCLK         STM32_HSECLK

  #elif STM32_MCOSEL == STM32_MCOSEL_PLLRCLK
    #define STM32_MCODIVCLK         STM32_PLL_R_CLKOUT

  #elif STM32_MCOSEL == STM32_MCOSEL_LSI
    #define STM32_MCODIVCLK         STM32_LSICLK

  #elif STM32_MCOSEL == STM32_MCOSEL_LSE
    #define STM32_MCODIVCLK         STM32_LSECLK

  #elif STM32_MCOSEL == STM32_MCOSEL_PLLPCLK
    #define STM32_MCODIVCLK         STM32_PLLPCLK

  #elif STM32_MCOSEL == STM32_MCOSEL_PLLQCLK
    #define STM32_MCODIVCLK         STM32_PLLQCLK

  #elif STM32_MCOSEL == STM32_MCOSEL_RTCCLK
    #define STM32_MCODIVCLK         STM32_RTCCLK

  #elif STM32_MCOSEL == STM32_MCOSEL_RTCWKP
    #define STM32_MCODIVCLK         STM32_RTCWKP

  #else
    #error "invalid STM32_MCOSEL value specified"
  #endif

#else /* Other devices */
  #if (STM32_MCOSEL == STM32_MCOSEL_NOCLOCK) || defined(__DOXYGEN__)
    #define STM32_MCODIVCLK         0

  #elif STM32_MCOSEL == STM32_MCOSEL_SYSCLK
    #define STM32_MCODIVCLK         STM32_SYSCLK

  #elif STM32_MCOSEL == STM32_MCOSEL_HSI16
    #define STM32_MCODIVCLK         STM32_HSI16CLK

  #elif STM32_MCOSEL == STM32_MCOSEL_HSI48
    #define STM32_MCODIVCLK         STM32_HSI48CLK

  #elif STM32_MCOSEL == STM32_MCOSEL_HSE
    #define STM32_MCODIVCLK         STM32_HSECLK

  #elif STM32_MCOSEL == STM32_MCOSEL_PLLRCLK
    #define STM32_MCODIVCLK         STM32_PLL_R_CLKOUT

  #elif STM32_MCOSEL == STM32_MCOSEL_LSI
    #define STM32_MCODIVCLK         STM32_LSICLK

  #elif STM32_MCOSEL == STM32_MCOSEL_LSE
    #define STM32_MCODIVCLK         STM32_LSECLK

  #else
    #error "invalid STM32_MCOSEL value specified"
  #endif
#endif

/**
 * @brief   MCO output pin clock divider.
 */
#if (STM32_MCOPRE == STM32_MCOPRE_DIV1) || defined(__DOXYGEN__)
  #define STM32_MCOCLK              STM32_MCODIVCLK

#elif STM32_MCOPRE == STM32_MCOPRE_DIV2
  #define STM32_MCOCLK              (STM32_MCODIVCLK / 2)

#elif STM32_MCOPRE == STM32_MCOPRE_DIV4
  #define STM32_MCOCLK              (STM32_MCODIVCLK / 4)

#elif STM32_MCOPRE == STM32_MCOPRE_DIV8
  #define STM32_MCOCLK              (STM32_MCODIVCLK / 8)

#elif STM32_MCOPRE == STM32_MCOPRE_DIV16
  #define STM32_MCOCLK              (STM32_MCODIVCLK / 16)

#elif STM32_MCOPRE == STM32_MCOPRE_DIV32
  #define STM32_MCOCLK              (STM32_MCODIVCLK / 32)

#elif STM32_MCOPRE == STM32_MCOPRE_DIV64
  #define STM32_MCOCLK              (STM32_MCODIVCLK / 64)

#elif STM32_MCOPRE == STM32_MCOPRE_DIV128
  #define STM32_MCOCLK              (STM32_MCODIVCLK / 128)

#elif STM32_MCOPRE == STM32_MCOPRE_DIV256
  #define STM32_MCOCLK              (STM32_MCODIVCLK / 256)

#elif STM32_MCOPRE == STM32_MCOPRE_DIV512
  #define STM32_MCOCLK              (STM32_MCODIVCLK / 512)

#elif STM32_MCOPRE == STM32_MCOPRE_DIV1024
  #define STM32_MCOCLK              (STM32_MCODIVCLK / 1024)

#else
  #error "invalid STM32_MCOPRE value specified"
#endif

#if (STM32_RCC_HAS_MCO2 == TRUE) || defined(__DOXYGEN__)
  /**
   * @brief   MCO2 divider clock source.
   */
  #if (STM32_MCO2SEL == STM32_MCO2SEL_NOCLOCK) || defined(__DOXYGEN__)
    #define STM32_MCO2DIVCLK         0

  #elif STM32_MCO2SEL == STM32_MCO2SEL_SYSCLK
    #define STM32_MCO2DIVCLK         STM32_SYSCLK

