ArduPilot/ardupilot/modules/ChibiOS/os/hal/ports/STM32/STM32G0xx/hal_lld.h
  #elif STM32_MCO2SEL == STM32_MCO2SEL_HSI16
    #define STM32_MCO2DIVCLK         STM32_HSI16CLK

  #elif STM32_MCO2SEL == STM32_MCO2SEL_HSI48
    #define STM32_MCO2DIVCLK         STM32_HSI48CLK

  #elif STM32_MCO2SEL == STM32_MCO2SEL_HSE
    #define STM32_MCO2DIVCLK         STM32_HSECLK

  #elif STM32_MCO2SEL == STM32_MCO2SEL_PLLRCLK
    #define STM32_MCO2DIVCLK         STM32_PLL_R_CLKOUT

  #elif STM32_MCO2SEL == STM32_MCO2SEL_LSI
    #define STM32_MCO2DIVCLK         STM32_LSICLK

  #elif STM32_MCO2SEL == STM32_MCO2SEL_LSE
    #define STM32_MCO2DIVCLK         STM32_LSECLK

  #elif STM32_MCO2SEL == STM32_MCO2SEL_PLLPCLK
    #define STM32_MCO2DIVCLK         STM32_PLLPCLK

  #elif STM32_MCO2SEL == STM32_MCO2SEL_PLLQCLK
    #define STM32_MCO2DIVCLK         STM32_PLLQCLK

  #elif STM32_MCO2SEL == STM32_MCO2SEL_RTCCLK
    #define STM32_MCO2DIVCLK         STM32_RTCCLK

  #elif STM32_MCO2SEL == STM32_MCO2SEL_RTCWKP
    #define STM32_MCO2DIVCLK         STM32_RTCWKP

  #else
    #error "invalid STM32_MCO2SEL value specified"
  #endif

  /**
   * @brief   MCO2 output pin clock divider.
   */
  #if (STM32_MCO2PRE == STM32_MCO2PRE_DIV1) || defined(__DOXYGEN__)
    #define STM32_MCO2CLK           STM32_MCO2DIVCLK

  #elif STM32_MCO2PRE == STM32_MCO2PRE_DIV2
    #define STM32_MCO2CLK           (STM32_MCO2DIVCLK / 2)

  #elif STM32_MCO2PRE == STM32_MCO2PRE_DIV4
    #define STM32_MCO2CLK           (STM32_MCO2DIVCLK / 4)

  #elif STM32_MCO2PRE == STM32_MCO2PRE_DIV8
    #define STM32_MCO2CLK           (STM32_MCO2DIVCLK / 8)

  #elif STM32_MCO2PRE == STM32_MCO2PRE_DIV16
    #define STM32_MCO2CLK           (STM32_MCO2DIVCLK / 16)

  #elif STM32_MCO2PRE == STM32_MCO2PRE_DIV32
    #define STM32_MCO2CLK           (STM32_MCO2DIVCLK / 32)

  #elif STM32_MCO2PRE == STM32_MCO2PRE_DIV64
    #define STM32_MCO2CLK           (STM32_MCO2DIVCLK / 64)

  #elif STM32_MCO2PRE == STM32_MCO2PRE_DIV128
    #define STM32_MCO2CLK           (STM32_MCO2DIVCLK / 128)

  #elif STM32_MCO2PRE == STM32_MCO2PRE_DIV256
    #define STM32_MCO2CLK           (STM32_MCO2DIVCLK / 256)

  #elif STM32_MCO2PRE == STM32_MCO2PRE_DIV512
    #define STM32_MCO2CLK           (STM32_MCO2DIVCLK / 512)

  #elif STM32_MCO2PRE == STM32_MCO2PRE_DIV1024
    #define STM32_MCO2CLK           (STM32_MCO2DIVCLK / 1024)

  #else
    #error "invalid STM32_MCO2PRE value specified"
  #endif
#endif /* STM32_RCC_HAS_MCO2 == TRUE */

/**
 * @brief   RTC clock frequency.
 */
#if (STM32_RTCSEL == STM32_RTCSEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_RTCCLK              0

#elif STM32_RTCSEL == STM32_RTCSEL_LSE
  #define STM32_RTCCLK              STM32_LSECLK

#elif STM32_RTCSEL == STM32_RTCSEL_LSI
  #define STM32_RTCCLK              STM32_LSICLK

#elif STM32_RTCSEL == STM32_RTCSEL_HSEDIV
  #define STM32_RTCCLK              (STM32_HSECLK / 32)

#else
  #error "invalid STM32_RTCSEL value specified"
#endif

/**
 * @brief   USART1 clock frequency.
 */
#if (STM32_USART1SEL == STM32_USART1SEL_PCLK) || defined(__DOXYGEN__)
  #define STM32_USART1CLK           hal_lld_get_clock_point(CLK_PCLK)

#elif STM32_USART1SEL == STM32_USART1SEL_SYSCLK
  #define STM32_USART1CLK           hal_lld_get_clock_point(CLK_SYSCLK)

#elif STM32_USART1SEL == STM32_USART1SEL_HSI16
  #define STM32_USART1CLK           STM32_HSI16CLK

#elif STM32_USART1SEL == STM32_USART1SEL_LSE
  #define STM32_USART1CLK           STM32_LSECLK

#else
  #error "invalid source selected for USART1 clock"
#endif

/**
 * @brief   USART2 clock frequency.
 */
#if (STM32_USART2SEL == STM32_USART2SEL_PCLK) || defined(__DOXYGEN__)
  #define STM32_USART2CLK           hal_lld_get_clock_point(CLK_PCLK)

#elif STM32_USART2SEL == STM32_USART2SEL_SYSCLK
  #define STM32_USART2CLK           hal_lld_get_clock_point(CLK_SYSCLK)

#elif STM32_USART2SEL == STM32_USART2SEL_HSI16
  #define STM32_USART2CLK           STM32_HSI16CLK

#elif STM32_USART2SEL == STM32_USART2SEL_LSE
  #define STM32_USART2CLK           STM32_LSECLK

#else
  #error "invalid source selected for USART2 clock"
#endif

/**
 * @brief   USART3 clock frequency.
 */
#if defined(STM32G0B1xx) || defined(STM32G0C1xx)
#if (STM32_USART3SEL == STM32_USART3SEL_PCLK) || defined(__DOXYGEN__)
  #define STM32_USART3CLK           hal_lld_get_clock_point(CLK_PCLK)

#elif STM32_USART3SEL == STM32_USART3SEL_SYSCLK
  #define STM32_USART3CLK           hal_lld_get_clock_point(CLK_SYSCLK)

#elif STM32_USART3SEL == STM32_USART3SEL_HSI16
  #define STM32_USART3CLK           STM32_HSI16CLK

#elif STM32_USART3SEL == STM32_USART3SEL_LSE
  #define STM32_USART3CLK           STM32_LSECLK
#else
  #error "invalid source selected for USART3 clock"
#endif

#else
  #define STM32_USART3CLK           hal_lld_get_clock_point(CLK_PCLK)
#endif

/**
 * @brief   UART4 frequency.
 */
#define STM32_UART4CLK              hal_lld_get_clock_point(CLK_PCLK)

/**
 * @brief   UART5 frequency.
 */
#define STM32_UART5CLK              hal_lld_get_clock_point(CLK_PCLK)

/**
 * @brief   UART6 frequency.
 */
#define STM32_UART6CLK              hal_lld_get_clock_point(CLK_PCLK)

/**
 * @brief   LPUART1 clock frequency.
 */
#if (STM32_LPUART1SEL == STM32_LPUART1SEL_PCLK) || defined(__DOXYGEN__)
  #define STM32_LPUART1CLK          hal_lld_get_clock_point(CLK_PCLK)

#elif STM32_LPUART1SEL == STM32_LPUART1SEL_SYSCLK
  #define STM32_LPUART1CLK          hal_lld_get_clock_point(CLK_SYSCLK)

#elif STM32_LPUART1SEL == STM32_LPUART1SEL_HSI16
  #define STM32_LPUART1CLK          STM32_HSI16CLK

#elif STM32_LPUART1SEL == STM32_LPUART1SEL_LSE
  #define STM32_LPUART1CLK          STM32_LSECLK

#else
  #error "invalid source selected for LPUART1 clock"
#endif

/**
 * @brief   LPUART2 clock frequency.
 */
#if defined(STM32G0B1xx) || defined(STM32G0C1xx) || defined(__DOXYGEN__)
#if (STM32_LPUART2SEL == STM32_LPUART2SEL_PCLK) || defined(__DOXYGEN__)
  #define STM32_LPUART2CLK          hal_lld_get_clock_point(CLK_PCLK)

#elif STM32_LPUART2SEL == STM32_LPUART2SEL_SYSCLK
  #define STM32_LPUART2CLK          hal_lld_get_clock_point(CLK_SYSCLK)

#elif STM32_LPUART2SEL == STM32_LPUART2SEL_HSI16
  #define STM32_LPUART2CLK          STM32_HSI16CLK

