ArduPilot/ardupilot/modules/ChibiOS/os/hal/ports/STM32/STM32G0xx/hal_lld.h
#elif STM32_LPUART2SEL == STM32_LPUART2SEL_LSE
  #define STM32_LPUART2CLK          STM32_LSECLK

#else
  #error "invalid source selected for LPUART2 clock"
#endif
#endif

/**
 * @brief   CEC clock frequency.
 */
#if (STM32_CECSEL == STM32_CECSEL_HSI16DIV) || defined(__DOXYGEN__)
  #define STM32_CECCLK              (STM32_HSI16CLK / 448)

#elif STM32_CECSEL == STM32_CECSEL_LSE
  #define STM32_CECCLK              STM32_LSECLK

#else
  #error "invalid source selected for CEC clock"
#endif

/**
 * @brief   I2C1 clock frequency.
 */
#if (STM32_I2C1SEL == STM32_I2C1SEL_PCLK) || defined(__DOXYGEN__)
  #define STM32_I2C1CLK             hal_lld_get_clock_point(CLK_PCLK)

#elif STM32_I2C1SEL == STM32_I2C1SEL_SYSCLK
  #define STM32_I2C1CLK             hal_lld_get_clock_point(CLK_SYSCLK)

#elif STM32_I2C1SEL == STM32_I2C1SEL_HSI16
  #define STM32_I2C1CLK             STM32_HSI16CLK

#else
  #error "invalid source selected for I2C1 clock"
#endif

/**
 * @brief   I2S1 clock frequency.
 */
#if (STM32_I2S1SEL == STM32_I2S1SEL_SYSCLK) || defined(__DOXYGEN__)
  #define STM32_I2S1CLK             hal_lld_get_clock_point(CLK_SYSCLK)

#elif STM32_I2S1SEL == STM32_I2S1SEL_PLLPCLK
  #define STM32_I2S1CLK             hal_lld_get_clock_point(CLK_PLLPCLK)

#elif STM32_I2S1SEL == STM32_I2S1SEL_HSI16
  #define STM32_I2S1CLK             STM32_HSI16CLK

#elif STM32_I2S1SEL == STM32_I2S1SEL_CKIN
  #define STM32_I2S1CLK             0 /* Unknown, would require a board value */

#else
#error "invalid source selected for I2S1 clock"
#endif

/**
 * @brief   LPTIM1 clock frequency.
 */
#if (STM32_LPTIM1SEL == STM32_LPTIM1SEL_PCLK) || defined(__DOXYGEN__)
  #define STM32_LPTIM1CLK           hal_lld_get_clock_point(CLK_PCLK)

#elif STM32_LPTIM1SEL == STM32_LPTIM1SEL_LSI
  #define STM32_LPTIM1CLK           STM32_LSICLK

#elif STM32_LPTIM1SEL == STM32_LPTIM1SEL_HSI16
  #define STM32_LPTIM1CLK           STM32_HSI16CLK

#elif STM32_LPTIM1SEL == STM32_LPTIM1SEL_LSE
  #define STM32_LPTIM1CLK           STM32_LSECLK

#else
#error "invalid source selected for LPTIM1 clock"
#endif

/**
 * @brief   LPTIM2 clock frequency.
 */
#if (STM32_LPTIM2SEL == STM32_LPTIM2SEL_PCLK) || defined(__DOXYGEN__)
  #define STM32_LPTIM2CLK           hal_lld_get_clock_point(CLK_PCLK)

#elif STM32_LPTIM2SEL == STM32_LPTIM2SEL_LSI
  #define STM32_LPTIM2CLK           STM32_LSICLK

#elif STM32_LPTIM2SEL == STM32_LPTIM2SEL_HSI16
  #define STM32_LPTIM2CLK           STM32_HSI16CLK

#elif STM32_LPTIM2SEL == STM32_LPTIM2SEL_LSE
  #define STM32_LPTIM2CLK           STM32_LSECLK

#else
#error "invalid source selected for LPTIM2 clock"
#endif

/**
 * @brief   RNGDIV field.
 */
#if (STM32_RNGDIV_VALUE == 1) || defined(__DOXYGEN__)
  #define STM32_RNGDIV              (0U << 28U)

#elif STM32_RNGDIV_VALUE == 2
  #define STM32_RNGDIV              (1U << 28U)

#elif STM32_RNGDIV_VALUE == 4
  #define STM32_RNGDIV              (2U << 28U)

#elif STM32_RNGDIV_VALUE == 8
  #define STM32_RNGDIV              (3U << 28U)

#else
  #error "invalid STM32_RNGDIV_VALUE value specified"
#endif

/**
 * @brief   RNG clock frequency.
 */
#if (STM32_RNGSEL == STM32_RNGSEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_RNGCLK              0

#elif STM32_RNGSEL == STM32_RNGSEL_HSI16
  #define STM32_RNGCLK              (STM32_HSI16CLK / STM32_RNGDIV_VALUE)

#elif STM32_RNGSEL == STM32_RNGSEL_SYSCLK
  #define STM32_RNGCLK              (hal_lld_get_clock_point(CLK_SYSCLK) / STM32_RNGDIV_VALUE)

#elif STM32_RNGSEL == STM32_RNGSEL_PLLQCLK
  #define STM32_RNGCLK              (hal_lld_get_clock_point(CLK_PLLQCLK) / STM32_RNGDIV_VALUE)

#else
#error "invalid source selected for RNG clock"
#endif

/**
 * @brief   ADC clock frequency.
 */
#if (STM32_ADCSEL == STM32_ADCSEL_SYSCLK) || defined(__DOXYGEN__)
  #define STM32_ADCCLK              hal_lld_get_clock_point(CLK_SYSCLK)

#elif STM32_ADCSEL == STM32_ADCSEL_PLLPCLK
  #define STM32_ADCCLK              hal_lld_get_clock_point(CLK_PLLPCLK)

#elif STM32_ADCSEL == STM32_ADCSEL_HSI16
  #define STM32_ADCCLK              STM32_HSI16CLK

#else
  #error "invalid source selected for ADC clock"
#endif

/**
 * @brief   TIMPCLK clock frequency.
 */
#if (STM32_PPRE == STM32_PPRE_DIV1) || defined(__DOXYGEN__)
  #define STM32_TIMPCLK             (STM32_PCLK * 1)

#else
  #define STM32_TIMPCLK             (STM32_PCLK * 2)
#endif

/**
 * @brief   TIM1 clock frequency.
 */
#if (STM32_TIM1SEL == STM32_TIM1SEL_TIMPCLK) || defined(__DOXYGEN__)
  #define STM32_TIM1CLK             STM32_TIMPCLK

#elif STM32_TIM1SEL == STM32_TIM1SEL_PLLQCLK
  #define STM32_TIM1CLK             hal_lld_get_clock_point(CLK_PLLQCLK)

#else
  #error "invalid source selected for TIM1 clock"
#endif

/**
 * @brief   TIM15 clock frequency.
 */
#if (STM32_TIM15SEL == STM32_TIM15SEL_TIMPCLK) || defined(__DOXYGEN__)
  #define STM32_TIM15CLK            STM32_TIMPCLK

#elif STM32_TIM15SEL == STM32_TIM15SEL_PLLQCLK
  #define STM32_TIM15CLK            hal_lld_get_clock_point(CLK_PLLQCLK)

#else
#error "invalid source selected for TIM15 clock"
#endif

/**
 * @brief   Clock of timers connected to APB1.
 */
#define STM32_TIMCLK1               hal_lld_get_clock_point(CLK_PCLKTIM)

/**
 * @brief   Clock of timers connected to APB2.
 */
#define STM32_TIMCLK2               hal_lld_get_clock_point(CLK_PCLKTIM)

#if STM32_HAS_TIM1617_ERRATA
/* TIM16 and TIM17 require special handling and checks on some devices, see
   the errata: "TIM16 and TIM17 are unduly clocked by SYSCLK".*/
#define STM32_TIM16CLK              hal_lld_get_clock_point(CLK_SYSCLK)
#define STM32_TIM17CLK              hal_lld_get_clock_point(CLK_SYSCLK)
#endif

/**
 * @brief   FDCAN clock point.
 */
#if (STM32_FDCANSEL == STM32_FDCANSEL_PCLK) || defined(__DOXYGEN__)
  #define STM32_FDCANCLK            hal_lld_get_clock_point(CLK_PCLK)

#elif STM32_FDCANSEL == STM32_FDCANSEL_PLLQCLK
  #define STM32_FDCANCLK            hal_lld_get_clock_point(CLK_PLLQCLK)

#elif STM32_FDCANSEL == STM32_FDCANSEL_HSE
  #define STM32_FDCANCLK            STM32_HSECLK

#else
  #error "invalid source selected for FDCAN clock"
#endif

/**
 * @brief   USB clock point.
 */
#if (STM32_USBSEL == STM32_USBSEL_HSI48) || defined(__DOXYGEN__)
  #define STM32_USBCLK              STM32_HSI48CLK

#elif STM32_USBSEL == STM32_USBSEL_PLLQCLK
  #define STM32_USBCLK              hal_lld_get_clock_point(CLK_PLLQCLK)

#elif STM32_USBSEL == STM32_USBSEL_HSE
  #define STM32_USBCLK              STM32_HSECLK

#else
  #error "invalid source selected for USB clock"
#endif

/**
 * @brief   Flash settings.
 */
#if (STM32_HCLK <= STM32_0WS_THRESHOLD) || defined(__DOXYGEN__)
  #define STM32_FLASHBITS           0

#elif STM32_HCLK <= STM32_1WS_THRESHOLD
  #define STM32_FLASHBITS           FLASH_ACR_LATENCY_0

#elif STM32_HCLK <= STM32_2WS_THRESHOLD
  #define STM32_FLASHBITS           FLASH_ACR_LATENCY_1

#else
  #define STM32_FLASHBITS           (FLASH_ACR_LATENCY_1 | FLASH_ACR_LATENCY_0)
#endif

/*===========================================================================*/
/* Driver data structures and types.                                         */
/*===========================================================================*/

/**
 * @brief   Type of a clock configuration and switch structure.
 */
typedef struct {
  uint32_t          pwr_cr1;
#if (STM32_PWR_HAS_CR2 == TRUE) || defined(__DOXYGEN__)
  uint32_t          pwr_cr2;
#endif
  uint32_t          rcc_cr;
  uint32_t          rcc_cfgr;
  uint32_t          rcc_pllcfgr;
  uint32_t          flash_acr;
} halclkcfg_t;

/**
 * @brief   Type of a timeout counter.
 * @note    16 bits because it must match TIM17 counter size.
 */
typedef uint16_t halcnt_t;

/*===========================================================================*/
/* Driver macros.                                                            */
/*===========================================================================*/

/**
 * @brief   Real time counter frequency exported to the safety module.
 * @note    The counter is clocked at 1MHz, the prescaler is recalculated
 *          if/when the input frequency changes.
 */
#define HAL_LLD_GET_CNT_FREQUENCY()         1000000U

/**
 * @brief   Real time counter value exported to the safety module.
 */
#define HAL_LLD_GET_CNT_VALUE()             ((halcnt_t)TIM17->CNT)

#if !defined(HAL_LLD_USE_CLOCK_MANAGEMENT)
/**
 * @brief   Returns the frequency of a clock point in Hz.
 * @note    Static implementation.
 *
 * @param[in] clkpt     clock point to be returned
 * @return              The clock point frequency in Hz or zero if the
 *                      frequency is unknown.
 *
 * @notapi
 */
  #if (STM32_RCC_HAS_MCO2 == TRUE) || defined(__DOXYGEN__)
    #define hal_lld_get_clock_point(clkpt)                                  \
      ((clkpt) == CLK_SYSCLK    ? STM32_SYSCLK        :                     \
       (clkpt) == CLK_HSISYSCLK ? STM32_HSISYSCLK     :                     \
       (clkpt) == CLK_PLLPCLK   ? STM32_PLL_P_CLKOUT  :                     \
       (clkpt) == CLK_PLLQCLK   ? STM32_PLL_Q_CLKOUT  :                     \
       (clkpt) == CLK_PLLRCLK   ? STM32_PLL_R_CLKOUT  :                     \
       (clkpt) == CLK_HCLK      ? STM32_HCLK          :                     \
       (clkpt) == CLK_PCLK      ? STM32_PCLK          :                     \
       (clkpt) == CLK_PCLKTIM   ? STM32_TIMPCLK       :                     \
       (clkpt) == CLK_MCO       ? STM32_MCOCLK        :                     \
       (clkpt) == CLK_MCO2      ? STM32_MCO2CLK       :                     \
       0U)

