ArduPilot/ardupilot/modules/ChibiOS/os/hal/ports/STM32/STM32G0xx/hal_lld.h
  #else /* STM32_RCC_HAS_MCO2 != TRUE */
    #define hal_lld_get_clock_point(clkpt)                                  \
      ((clkpt) == CLK_SYSCLK    ? STM32_SYSCLK        :                     \
       (clkpt) == CLK_HSISYSCLK ? STM32_HSISYSCLK     :                     \
       (clkpt) == CLK_PLLPCLK   ? STM32_PLL_P_CLKOUT  :                     \
       (clkpt) == CLK_PLLQCLK   ? STM32_PLL_Q_CLKOUT  :                     \
       (clkpt) == CLK_PLLRCLK   ? STM32_PLL_R_CLKOUT  :                     \
       (clkpt) == CLK_HCLK      ? STM32_HCLK          :                     \
       (clkpt) == CLK_PCLK      ? STM32_PCLK          :                     \
       (clkpt) == CLK_PCLKTIM   ? STM32_TIMPCLK       :                     \
       (clkpt) == CLK_MCO       ? STM32_MCOCLK        :                     \
       0U)
  #endif /* STM32_RCC_HAS_MCO2 != TRUE */
#endif /* !defined(HAL_LLD_USE_CLOCK_MANAGEMENT) */

/*===========================================================================*/
/* External declarations.                                                    */
/*===========================================================================*/

/* Various helpers.*/
#include "nvic.h"
#include "cache.h"
#include "stm32_isr.h"
#include "stm32_dma.h"
#include "stm32_exti.h"
#include "stm32_rcc.h"
#include "stm32_tim.h"

#if defined(HAL_LLD_USE_CLOCK_MANAGEMENT) && !defined(__DOXYGEN__)
extern const halclkcfg_t hal_clkcfg_reset;
extern const halclkcfg_t hal_clkcfg_default;
#endif

#ifdef __cplusplus
extern "C" {
#endif
  void hal_lld_init(void);
  void stm32_clock_init(void);
#if defined(HAL_LLD_USE_CLOCK_MANAGEMENT) || defined(__DOXYGEN__)
  bool hal_lld_clock_switch_mode(const halclkcfg_t *ccp);
  halfreq_t hal_lld_get_clock_point(halclkpt_t clkpt);
#endif /* defined(HAL_LLD_USE_CLOCK_MANAGEMENT) */
#ifdef __cplusplus
}
#endif

#endif /* HAL_LLD_H */

/** @} */
